burakenez/gd32e502-demo-suites-cmake-vscode/Drivers/GD32E502_standard_peripheral/Include/gd32e502_mfcom.h
/* MFCOM timer stopbit */
#define TMCFG_TMSTOP(regval)                    (BITS(4,5) & ((uint32_t)(regval) << 4U))
#define MFCOM_TIMER_STOPBIT_DISABLE             TMCFG_TMSTOP(0)                                         /*!< stop bit disabled */
#define MFCOM_TIMER_STOPBIT_TIMCMP              TMCFG_TMSTOP(1)                                         /*!< stop bit is enabled on timer compare */
#define MFCOM_TIMER_STOPBIT_TIMDIS              TMCFG_TMSTOP(2)                                         /*!< stop bit is enabled on timer disable */
#define MFCOM_TIMER_STOPBIT_TIMCMP_TIMDIS       TMCFG_TMSTOP(3)                                         /*!< stop bit is enabled on timer compare and timer disable */

/* MFCOM timer startbit */
#define MFCOM_TIMER_STARTBIT_DISABLE            ((uint32_t)0x00000000U)                                 /*!< start bit disabled */
#define MFCOM_TIMER_STARTBIT_ENABLE             MFCOM_TMCFG_TMSTART                                     /*!< start bit enabled */

/* MFCOM shifter timer select */
#define SCTL_TMSEL(regval)                      (BITS(24,25) & ((uint32_t)(regval) << 24U))
#define MFCOM_SHIFTER_TIMER0                    SCTL_TMSEL(0)                                           /*!< timer0 selected */
#define MFCOM_SHIFTER_TIMER1                    SCTL_TMSEL(1)                                           /*!< timer1 selected */
#define MFCOM_SHIFTER_TIMER2                    SCTL_TMSEL(2)                                           /*!< timer2 selected */
#define MFCOM_SHIFTER_TIMER3                    SCTL_TMSEL(3)                                           /*!< timer3 selected */

/* type of timer polarity for shifter control */
#define MFCOM_SHIFTER_TIMPOL_ACTIVE_HIGH        ((uint32_t)0x00000000U)                                 /*!< shift on positive edge of shift clock */
#define MFCOM_SHIFTER_TIMPOL_ACTIVE_LOW         MFCOM_SCTL_TMPL                                         /*!< shift on negative edge of shift clock */

/* MFCOM shifter pin config */
#define SCTL_SPCFG(regval)                      (BITS(16,17) & ((uint32_t)(regval) << 16U))
#define MFCOM_SHIFTER_PINCFG_INPUT              SCTL_SPCFG(0)                                           /*!< pin input */
#define MFCOM_SHIFTER_PINCFG_OPENDRAIN          SCTL_SPCFG(1)                                           /*!< pin open drain */
#define MFCOM_SHIFTER_PINCFG_BIDI               SCTL_SPCFG(2)                                           /*!< pin cascade input/output */
#define MFCOM_SHIFTER_PINCFG_OUTPUT             SCTL_SPCFG(3)                                           /*!< pin output */

/* MFCOM shifter pin select */
#define SCTL_SPSEL(regval)                      (BITS(8,10) & ((uint32_t)(regval) << 8U))
#define MFCOM_SHIFTER_PINSEL_PIN0               SCTL_SPSEL(0)                                           /*!< shifter pin 0 selected */
#define MFCOM_SHIFTER_PINSEL_PIN1               SCTL_SPSEL(1)                                           /*!< shifter pin 1 selected */
#define MFCOM_SHIFTER_PINSEL_PIN2               SCTL_SPSEL(2)                                           /*!< shifter pin 2 selected */
#define MFCOM_SHIFTER_PINSEL_PIN3               SCTL_SPSEL(3)                                           /*!< shifter pin 3 selected */
#define MFCOM_SHIFTER_PINSEL_PIN4               SCTL_SPSEL(4)                                           /*!< shifter pin 4 selected */
#define MFCOM_SHIFTER_PINSEL_PIN5               SCTL_SPSEL(5)                                           /*!< shifter pin 5 selected */
#define MFCOM_SHIFTER_PINSEL_PIN6               SCTL_SPSEL(6)                                           /*!< shifter pin 6 selected */
#define MFCOM_SHIFTER_PINSEL_PIN7               SCTL_SPSEL(7)                                           /*!< shifter pin 7 selected */

/* MFCOM shifter pin polarity */
#define MFCOM_SHIFTER_PINPOL_ACTIVE_HIGH        ((uint32_t)0x00000000U)                                 /*!< active high */
#define MFCOM_SHIFTER_PINPOL_ACTIVE_LOW         MFCOM_SCTL_SPPL                                         /*!< active low */

/* MFCOM shifter mode */
#define SCTL_SMOD(regval)                       (BITS(0,2) & ((uint32_t)(regval) << 0U))
#define MFCOM_SHIFTER_DISABLE                   SCTL_SMOD(0)                                            /*!< shifter is disabled */
#define MFCOM_SHIFTER_RECEIVE                   SCTL_SMOD(1)                                            /*!< receive mode */
#define MFCOM_SHIFTER_TRANSMIT                  SCTL_SMOD(2)                                            /*!< transmit mode */
#define MFCOM_SHIFTER_MATCH_STORE               SCTL_SMOD(4)                                            /*!< match store mode */
#define MFCOM_SHIFTER_MATCH_CONTINUOUS          SCTL_SMOD(5)                                            /*!< match continuous mode */

/* MFCOM shifter input source */
#define MFCOM_SHIFTER_INSRC_PIN                 ((uint32_t)0x00000000U)                                 /*!< shifter input from pin */
#define MFCOM_SHIFTER_INSRC_NEXTSHIFTER         MFCOM_SCFG_INSRC                                        /*!< shifter input from shifter x+1 */

/* MFCOM shifter stopbit */
#define SCFG_SSTOP(regval)                      (BITS(4,5) & ((uint32_t)(regval) << 4U))
#define MFCOM_SHIFTER_STOPBIT_DISABLE           SCFG_SSTOP(0)                                           /*!< disable shifter stop bit */
#define MFCOM_SHIFTER_STOPBIT_LOW               SCFG_SSTOP(2)                                           /*!< set shifter stop bit to logic low level */
#define MFCOM_SHIFTER_STOPBIT_HIGH              SCFG_SSTOP(3)                                           /*!< set shifter stop bit to logic high level */

/* MFCOM shifter startbit */
#define SCFG_SSTART(regval)                     (BITS(0,1) & ((uint32_t)(regval) << 0U))
#define MFCOM_SHIFTER_STARTBIT_DISABLE          SCFG_SSTART(0)                                          /*!< disable shifter start bit, transmitter loads data on enable */
#define MFCOM_SHIFTER_STARTBIT_DISABLE_TXEN     SCFG_SSTART(1)                                          /*!< disable shifter start bit, transmitter loads data on first shift */
#define MFCOM_SHIFTER_STARTBIT_LOW              SCFG_SSTART(2)                                          /*!< set shifter start bit to logic low level */
#define MFCOM_SHIFTER_STARTBIT_HIGH             SCFG_SSTART(3)                                          /*!< set shifter start bit to logic high level */

