burakenez/gd32e502-demo-suites-cmake-vscode/Drivers/GD32E502_standard_peripheral/Include/gd32e502_mfcom.h
/* MFCOM shifter enum */
#define MFCOM_SHIFTER_0                         ((uint32_t)0x00000000U)                                 /*!< MFCOM shifter0 */
#define MFCOM_SHIFTER_1                         ((uint32_t)0x00000001U)                                 /*!< MFCOM shifter1 */
#define MFCOM_SHIFTER_2                         ((uint32_t)0x00000002U)                                 /*!< MFCOM shifter2 */
#define MFCOM_SHIFTER_3                         ((uint32_t)0x00000003U)                                 /*!< MFCOM shifter3 */

/* MFCOM timer enum */
#define MFCOM_TIMER_0                           ((uint32_t)0x00000000U)                                 /*!< MFCOM timer0 */
#define MFCOM_TIMER_1                           ((uint32_t)0x00000001U)                                 /*!< MFCOM timer1 */
#define MFCOM_TIMER_2                           ((uint32_t)0x00000002U)                                 /*!< MFCOM timer2 */
#define MFCOM_TIMER_3                           ((uint32_t)0x00000003U)                                 /*!< MFCOM timer3 */

/* MFCOM read write mode enum */
#define MFCOM_RWMODE_NORMAL                     ((uint32_t)0x00000000U)                                 /*!< read and write in normal mode */
#define MFCOM_RWMODE_BITSWAP                    ((uint32_t)0x00000001U)                                 /*!< read and write in bit swapped mode */
#define MFCOM_RWMODE_BYTESWAP                   ((uint32_t)0x00000002U)                                 /*!< read and write in byte swapped mode */
#define MFCOM_RWMODE_BITBYTESWAP                ((uint32_t)0x00000003U)                                 /*!< read and write in bit byte swapped mode */

/* function declarations */
/* reset MFCOM */
void mfcom_deinit(void);
/* software reset */
void mfcom_software_reset(void);
/* enable MFCOM function */
void mfcom_enable(void);
/* disable MFCOM function */
void mfcom_disable(void);
/* initialize mfcom_timer_parameter_struct with the default values */
void mfcom_timer_struct_para_init(mfcom_timer_parameter_struct* init_struct);
/* initialize mfcom_shifter_parameter_struct with the default values */
void mfcom_shifter_struct_para_init(mfcom_shifter_parameter_struct* init_struct);

/* initialize MFCOM timer */
void mfcom_timer_init(uint32_t timer, mfcom_timer_parameter_struct* init_struct);
/* initialize MFCOM shifter */
void mfcom_shifter_init(uint32_t shifter, mfcom_shifter_parameter_struct* init_struct);

/* configure timer pin mode */
void mfcom_timer_pin_config(uint32_t timer, uint32_t mode);
/* configure shifter pin mode */
void mfcom_shifter_pin_config(uint32_t shifter, uint32_t mode);
/* enable MFCOM timer in specific mode */
void mfcom_timer_enable(uint32_t timer, uint32_t timermode);
/* enable MFCOM shifter in specific mode */
void mfcom_shifter_enable(uint32_t shifter, uint32_t shiftermode);
/* disable MFCOM timer */
void mfcom_timer_disable(uint32_t timer);
/* disable MFCOM shifter */
void mfcom_shifter_disable(uint32_t shifter);

/* set the timer compare value */
void mfcom_timer_cmpvalue_set(uint32_t timer, uint32_t compare);
/* get the timer compare value */
uint32_t mfcom_timer_cmpvalue_get(uint32_t timer);
/* set the timer disable source */
void mfcom_timer_dismode_set(uint32_t timer, uint32_t dismode);

/* set the shifter stopbit */
void mfcom_shifter_stopbit_set(uint32_t shifter, uint32_t stopbit);
/* write MFCOM shifter buffer */
void mfcom_buffer_write(uint32_t shifter, uint32_t data, uint32_t rwmode);
/* read MFCOM shifter buffer */
uint32_t mfcom_buffer_read(uint32_t shifter, uint32_t rwmode);
/* get MFCOM shifter flag */
FlagStatus mfcom_shifter_flag_get(uint32_t shifter);
/* get MFCOM shifter error flag */
FlagStatus mfcom_shifter_error_flag_get(uint32_t shifter);
/* get MFCOM timer flag */
FlagStatus mfcom_timer_flag_get(uint32_t timer);

/* get MFCOM shifter interrupt flag */
FlagStatus mfcom_shifter_interrupt_flag_get(uint32_t shifter);
/* get MFCOM shifter error interrupt flag */
FlagStatus mfcom_shifter_error_interrupt_flag_get(uint32_t shifter);
/* get MFCOM timer interrupt flag */
FlagStatus mfcom_timer_interrupt_flag_get(uint32_t timer);

/* clear MFCOM shifter flag */
void mfcom_shifter_flag_clear(uint32_t shifter);
/* clear MFCOM shifter error flag */
void mfcom_shifter_error_flag_clear(uint32_t shifter);
/* clear MFCOM timer flag */
void mfcom_timer_flag_clear(uint32_t timer);

/* enable MFCOM shifter interrupt */
void mfcom_shifter_interrupt_enable(uint32_t shifter);
/* enable MFCOM shifter error interrupt */
void mfcom_shifter_error_interrupt_enable(uint32_t shifter);
/* enable MFCOM timer interrupt */
void mfcom_timer_interrupt_enable(uint32_t timer);
/* enable MFCOM shifter dma */
void mfcom_shifter_dma_enable(uint32_t shifter);

/* disable MFCOM shifter interrupt */
void mfcom_shifter_interrupt_disable(uint32_t shifter);
/* disable MFCOM shifter error interrupt */
void mfcom_shifter_error_interrupt_disable(uint32_t shifter);
/* disable MFCOM timer interrupt */
void mfcom_timer_interrupt_disable(uint32_t timer);
/* disable MFCOM shifter dma */
void mfcom_shifter_dma_disable(uint32_t shifter);

#endif /* GD32E502_MFCOM_H */
